dinga1981/esp8266-ai/firmware/src/main.cpp
// ESP8266 WiFi clock: shows local time plus live Claude Code / Codex CLI
// working status and usage quota, polled from a small bridge service that
// runs on the developer's Mac (see ../bridge/bridge.py).
//
// Display: 240x240 SPI ST7789 (TFT_eSPI). Pin mapping is set via build_flags
// in platformio.ini - edit those if your wiring differs.

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <Updater.h>
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>

#include "config.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"

TFT_eSPI tft = TFT_eSPI();
ESP8266WebServer webServer(80);

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude or
// /sprite/codex (the device serves its own upload page at "/"); the ESP8266
// decodes and rescales the GIF *on-device* (AnimatedGIF, line-by-line so it
// never needs a full-canvas buffer) into the wire format below, which the
// display path then reads back frame-by-frame:
//   [1 byte frame count][frame0 bytes][frame1 bytes]...
// Each frame is exactly CLAUDE_SPRITE_W x H (or CODEX_SPRITE_W x H) RGB565
// pixels, byte order matching tools/convert_sprites.py's to_rgb565() so the
// compiled-in defaults and custom uploads share one draw path.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers, which wouldn't fit alongside a static
// full-frame buffer (a 120x120 frame is ~28KB) on the ESP8266's ~80KB. So both
// the display path and the decoder work one screen-row at a time through these
// two small scratch rows (SCREEN_W is the widest we ever need).
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t prevRowBuf[SCREEN_W]; // decode only: same row from the previous frame

bool claudeCustom = false;
int claudeCustomFrames = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

const int SCREEN_CX = 120, SCREEN_CY = 120;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const unsigned long ANIM_INTERVAL_MS = 120;  // sprite frame advance
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast
const unsigned long SWITCH_IDLE_MS = 6000;   // neither working: alternate slow

enum ActiveApp { APP_CLAUDE, APP_CODEX };
ActiveApp currentApp = APP_CLAUDE;
unsigned long lastSwitchMs = 0;

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// net/music = show Mac-side telemetry pages instead of the pet.
enum DisplayMode {
  MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_NET, MODE_MUSIC, MODE_STOCK, MODE_MARKET,
  MODE_WEATHER
};
DisplayMode displayMode = MODE_AUTO;

// ---------- reset / last-operation diagnostics ----------
// RTC user memory survives watchdog/software resets (but not necessarily a
// full power loss), so it can tell us which operation was active immediately
// before an unexpected restart without writing flash on every network poll.
enum RuntimeStage : uint8_t {
  STAGE_BOOT, STAGE_IDLE, STAGE_BRIDGE, STAGE_NET, STAGE_MUSIC, STAGE_STOCK,
  STAGE_WEATHER, STAGE_MARKET_META, STAGE_MARKET_FRAME, STAGE_WEB,
  STAGE_WIFI_RECOVERY, STAGE_OTA
};

enum RecoveryStep : uint8_t {
  RECOVERY_NONE, RECOVERY_QUICK_RECONNECT, RECOVERY_WIFI_REINIT,
  RECOVERY_RADIO_RESET, RECOVERY_PROTECTIVE_RESTART, RECOVERY_MANUAL
};

struct RtcRuntimeDiag {
  uint32_t magic;
  uint32_t checksum;
  uint32_t sequence;
  uint8_t stage;
  uint8_t mode;
  uint8_t wifiStatus;
  uint8_t recoveryStep;
  uint8_t firstWifiDisconnectReason;
  uint8_t lastWifiDisconnectReason;
  int8_t firstWifiRssi;
  uint8_t firstWifiChannel;
  uint8_t firstDisconnectWasRecovery;
  uint8_t lastDisconnectWasRecovery;
  uint16_t recoveryMask;
  uint8_t firstWifiBssid[6];
  uint8_t reserved[2];
  uint32_t bridgeFailures;
  uint32_t wifiDisconnectCount;
  uint32_t wifiReconnectCount;
  int32_t lastBridgeHttpCode;
  uint32_t outageDurationMs;
  uint32_t quickRecoveryAtMs;
  uint32_t wifiReinitAtMs;
  uint32_t radioResetAtMs;
  uint32_t protectiveRestartAtMs;
  uint32_t millisAtStage;
};
static_assert((sizeof(RtcRuntimeDiag) % 4) == 0, "RTC diagnostics must be word aligned");

const uint32_t RTC_DIAG_MAGIC = 0x4149434CUL; // "AICL"
// ESP8266 eboot stores its 128-byte OTA copy command at the start of RTC user
// memory. Diagnostics must begin after word 31 or a stage update between
// Update.end() and ESP.restart() can silently cancel an otherwise valid OTA.
const uint32_t RTC_DIAG_WORD_OFFSET = 32;
const char *BOOT_COUNT_FILE = "/boot_count.txt";
const char *RESTART_HISTORY_FILE = "/restart_history.bin";
const uint32_t RESTART_HISTORY_MAGIC = 0x52485331UL; // RHS1
const uint8_t RESTART_HISTORY_CAPACITY = 4;

struct RestartHistoryEntry {
  uint32_t bootCount;
  uint32_t rtcSequence;
  uint32_t outageDurationMs;
  uint8_t stage;
  uint8_t mode;
  uint8_t recoveryStep;
  uint8_t firstReason;
  uint8_t lastReason;
  uint8_t firstWasRecovery;
  int8_t firstRssi;
  uint8_t firstChannel;
  char resetReason[24];
};

struct RestartHistoryStore {
  uint32_t magic;
  uint32_t checksum;
  uint8_t count;
  uint8_t reserved[3];
  RestartHistoryEntry entries[RESTART_HISTORY_CAPACITY];
};

