dinga1981/esp8266-ai/firmware/src/main.cpp
RestartHistoryStore restartHistory = {};
RtcRuntimeDiag rtcRuntimeDiag = {};
uint8_t previousRuntimeStage = STAGE_BOOT;
uint8_t previousRuntimeMode = MODE_AUTO;
uint8_t previousRecoveryStep = RECOVERY_NONE;
uint8_t previousFirstWifiDisconnectReason = 0;
uint8_t previousLastWifiDisconnectReason = 0;
int8_t previousFirstWifiRssi = 0;
uint8_t previousFirstWifiChannel = 0;
bool previousFirstDisconnectWasRecovery = false;
bool previousLastDisconnectWasRecovery = false;
uint16_t previousRecoveryMask = 0;
uint8_t previousFirstWifiBssid[6] = {};
uint32_t previousBridgeFailures = 0;
uint32_t previousWifiDisconnectCount = 0;
uint32_t previousWifiReconnectCount = 0;
int32_t previousBridgeHttpCode = 0;
uint32_t previousOutageDurationMs = 0;
uint32_t previousQuickRecoveryAtMs = 0;
uint32_t previousWifiReinitAtMs = 0;
uint32_t previousRadioResetAtMs = 0;
uint32_t previousProtectiveRestartAtMs = 0;
uint8_t diagnosticEffectiveMode = MODE_AUTO;
uint32_t bootCount = 0;
char lastResetReason[32] = "Unknown";
char lastResetInfo[200] = "Unknown";

uint32_t rtcDiagChecksum(const RtcRuntimeDiag &value) {
  RtcRuntimeDiag copy = value;
  copy.checksum = 0;
  const uint8_t *bytes = reinterpret_cast<const uint8_t *>(&copy);
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < sizeof(copy); ++i) {
    hash ^= bytes[i];
    hash *= 16777619UL;
  }
  return hash;
}

uint32_t restartHistoryChecksum(const RestartHistoryStore &value) {
  RestartHistoryStore copy = value;
  copy.checksum = 0;
  const uint8_t *bytes = reinterpret_cast<const uint8_t *>(&copy);
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < sizeof(copy); ++i) { hash ^= bytes[i]; hash *= 16777619UL; }
  return hash;
}

void loadRestartHistory() {
  File f = LittleFS.open(RESTART_HISTORY_FILE, "r");
  if (!f || f.size() != sizeof(restartHistory) ||
      f.read(reinterpret_cast<uint8_t *>(&restartHistory), sizeof(restartHistory)) !=
          sizeof(restartHistory) || restartHistory.magic != RESTART_HISTORY_MAGIC ||
      restartHistory.count > RESTART_HISTORY_CAPACITY ||
      restartHistory.checksum != restartHistoryChecksum(restartHistory)) {
    restartHistory = {};
  }
  if (f) f.close();
}

void appendRestartHistory(const RtcRuntimeDiag &previous) {
  for (int i = RESTART_HISTORY_CAPACITY - 1; i > 0; --i) {
    restartHistory.entries[i] = restartHistory.entries[i - 1];
  }
  RestartHistoryEntry &entry = restartHistory.entries[0];
  entry = {};
  entry.bootCount = bootCount;
  entry.rtcSequence = previous.sequence;
  entry.outageDurationMs = previous.outageDurationMs;
  entry.stage = previous.stage;
  entry.mode = previous.mode;
  entry.recoveryStep = previous.recoveryStep;
  entry.firstReason = previous.firstWifiDisconnectReason;
  entry.lastReason = previous.lastWifiDisconnectReason;
  entry.firstWasRecovery = previous.firstDisconnectWasRecovery;
  entry.firstRssi = previous.firstWifiRssi;
  entry.firstChannel = previous.firstWifiChannel;
  strlcpy(entry.resetReason, lastResetReason, sizeof(entry.resetReason));
  restartHistory.count = min((uint8_t)(restartHistory.count + 1), RESTART_HISTORY_CAPACITY);
  restartHistory.magic = RESTART_HISTORY_MAGIC;
  restartHistory.checksum = restartHistoryChecksum(restartHistory);
  File f = LittleFS.open(RESTART_HISTORY_FILE, "w");
  if (f) {
    f.write(reinterpret_cast<const uint8_t *>(&restartHistory), sizeof(restartHistory));
    f.close();
  }
}

const char *runtimeStageName(uint8_t stage) {
  switch (stage) {
    case STAGE_BOOT: return "启动";
    case STAGE_IDLE: return "空闲";
    case STAGE_BRIDGE: return "桥接状态请求";
    case STAGE_NET: return "网速请求";
    case STAGE_MUSIC: return "音乐请求";
    case STAGE_STOCK: return "四行行情请求";
    case STAGE_WEATHER: return "天气请求";
    case STAGE_MARKET_META: return "K线元数据请求";
    case STAGE_MARKET_FRAME: return "K线帧请求";
    case STAGE_WEB: return "设备网页";
    case STAGE_WIFI_RECOVERY: return "Wi-Fi恢复";
    case STAGE_OTA: return "OTA升级";
    default: return "未知";
  }
}

const char *runtimeModeName(uint8_t mode) {
  switch (mode) {
    case MODE_AUTO: return "自动";
    case MODE_CLAUDE: return "Claude";
    case MODE_CODEX: return "Codex";
    case MODE_NET: return "网速";
    case MODE_MUSIC: return "音乐";
    case MODE_STOCK: return "四行报价";
    case MODE_MARKET: return "K线行情";
    case MODE_WEATHER: return "天气";
    default: return "未知";
  }
}

const char *wifiStatusName(uint8_t status) {
  switch (status) {
    case WL_CONNECTED: return "已连接";
    case WL_NO_SSID_AVAIL: return "找不到Wi-Fi";
    case WL_CONNECT_FAILED: return "连接失败";
    case WL_CONNECTION_LOST: return "连接丢失";
    case WL_DISCONNECTED: return "已断开";
    case WL_IDLE_STATUS: return "连接中";
    default: return "未知";
  }
}

const char *recoveryStepName(uint8_t step) {
  switch (step) {
    case RECOVERY_QUICK_RECONNECT: return "快速重连";
    case RECOVERY_WIFI_REINIT: return "重新初始化无线网络";
    case RECOVERY_RADIO_RESET: return "射频关闭/唤醒";
    case RECOVERY_PROTECTIVE_RESTART: return "保护性重启";
    case RECOVERY_MANUAL: return "用户手动重连";
    default: return "无";
  }
}

const char *disconnectOriginName(bool recoveryGenerated) {
  return recoveryGenerated ? "固件恢复动作" : "外部/AP/协议栈";
}

String disconnectEventText(uint8_t reason, bool recoveryGenerated) {
  if (reason == 0) return "无记录";
  return String((unsigned)reason) + "（" + disconnectOriginName(recoveryGenerated) + "）";
}

String wifiBssidText(const uint8_t *bssid) {
  char value[18];
  snprintf(value, sizeof(value), "%02X:%02X:%02X:%02X:%02X:%02X",
           bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5]);
  return String(value);
}

String recoveryTimelineText(uint32_t quick, uint32_t reinit,
                            uint32_t radio, uint32_t restart) {
  String value = "快速:";
  value += quick ? String(quick / 1000UL) + "s" : "--";
  value += " 重置:";
  value += reinit ? String(reinit / 1000UL) + "s" : "--";
  value += " 射频:";
  value += radio ? String(radio / 1000UL) + "s" : "--";
  value += " 重启:";
  value += restart ? String(restart / 1000UL) + "s" : "--";
  return value;
}

void writeRtcRuntimeDiag() {
  rtcRuntimeDiag.magic = RTC_DIAG_MAGIC;
  rtcRuntimeDiag.checksum = rtcDiagChecksum(rtcRuntimeDiag);
  ESP.rtcUserMemoryWrite(RTC_DIAG_WORD_OFFSET, reinterpret_cast<uint32_t *>(&rtcRuntimeDiag),
                         sizeof(rtcRuntimeDiag));
}

