dinga1981/esp8266-ai/firmware/src/main.cpp
void saveRuntimeStage(RuntimeStage stage) {
  if (rtcRuntimeDiag.stage == stage && rtcRuntimeDiag.mode == diagnosticEffectiveMode &&
      rtcRuntimeDiag.wifiStatus == (uint8_t)WiFi.status()) return;
  rtcRuntimeDiag.stage = stage;
  rtcRuntimeDiag.mode = diagnosticEffectiveMode;
  rtcRuntimeDiag.wifiStatus = (uint8_t)WiFi.status();
  rtcRuntimeDiag.millisAtStage = millis();
  writeRtcRuntimeDiag();
}

void loadBootDiagnostics() {
  strlcpy(lastResetReason, ESP.getResetReason().c_str(), sizeof(lastResetReason));
  strlcpy(lastResetInfo, ESP.getResetInfo().c_str(), sizeof(lastResetInfo));

  RtcRuntimeDiag previous = {};
  const bool previousValid = ESP.rtcUserMemoryRead(
      RTC_DIAG_WORD_OFFSET, reinterpret_cast<uint32_t *>(&previous),
                            sizeof(previous)) &&
      previous.magic == RTC_DIAG_MAGIC && previous.checksum == rtcDiagChecksum(previous);
  if (previousValid) {
    previousRuntimeStage = previous.stage;
    previousRuntimeMode = previous.mode;
    previousRecoveryStep = previous.recoveryStep;
    previousFirstWifiDisconnectReason = previous.firstWifiDisconnectReason;
    previousLastWifiDisconnectReason = previous.lastWifiDisconnectReason;
    previousFirstWifiRssi = previous.firstWifiRssi;
    previousFirstWifiChannel = previous.firstWifiChannel;
    previousFirstDisconnectWasRecovery = previous.firstDisconnectWasRecovery != 0;
    previousLastDisconnectWasRecovery = previous.lastDisconnectWasRecovery != 0;
    previousRecoveryMask = previous.recoveryMask;
    memcpy(previousFirstWifiBssid, previous.firstWifiBssid, sizeof(previousFirstWifiBssid));
    previousBridgeFailures = previous.bridgeFailures;
    previousWifiDisconnectCount = previous.wifiDisconnectCount;
    previousWifiReconnectCount = previous.wifiReconnectCount;
    previousBridgeHttpCode = previous.lastBridgeHttpCode;
    previousOutageDurationMs = previous.outageDurationMs;
    previousQuickRecoveryAtMs = previous.quickRecoveryAtMs;
    previousWifiReinitAtMs = previous.wifiReinitAtMs;
    previousRadioResetAtMs = previous.radioResetAtMs;
    previousProtectiveRestartAtMs = previous.protectiveRestartAtMs;
    rtcRuntimeDiag.sequence = previous.sequence + 1;
  } else {
    rtcRuntimeDiag.sequence = 1;
  }

  if (LittleFS.exists(BOOT_COUNT_FILE)) {
    File f = LittleFS.open(BOOT_COUNT_FILE, "r");
    if (f) { bootCount = (uint32_t)f.readString().toInt(); f.close(); }
  }
  bootCount++;
  File f = LittleFS.open(BOOT_COUNT_FILE, "w");
  if (f) { f.print(bootCount); f.close(); }
  loadRestartHistory();
  if (previousValid) appendRestartHistory(previous);
  saveRuntimeStage(STAGE_BOOT);
}

// AUTO is a user-configurable carousel. Bit N selects DisplayMode N; AUTO
// itself is never a carousel page. Default preserves the original two-pet
// experience until the user changes it from the Mac menu.
uint16_t weekdayAutoPageMask = (1U << MODE_CODEX);
uint16_t weekdayAutoCycleSeconds = AUTO_CYCLE_DEFAULT_SECONDS;
uint16_t weekendAutoPageMask = (1U << MODE_CODEX);
uint16_t weekendAutoCycleSeconds = AUTO_CYCLE_DEFAULT_SECONDS;
uint8_t autoPageIndex = 0;
unsigned long autoPageStartedMs = 0;
bool lastAutoScheduleWeekend = false;

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
int netCpuPct = -1, netMemPct = -1;        // Mac CPU/MEM row; -1 = bridge sends none (hidden)
String netLastCpuVal, netLastMemVal;       // change detection for the CPU/MEM values
bool netSysLabelsDrawn = false;
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
const int MUSIC_TEXT_W = 232;
const int MUSIC_TEXT_H = 44;
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
// ---------- stock watchlist mode state ----------
// Rows come pre-formatted from the bridge (GET /stock or serial #STOCK):
// ASCII code + price/pct strings + up flag, so the firmware just paints.
const unsigned long STOCK_POLL_INTERVAL_MS = 5000;
const int MAX_STOCKS = 4;
struct StockRow {
  char code[16] = "";
  char price[16] = "";
  char pct[12] = "";
  int up = 0; // 1 rising (red, CN convention) / -1 falling (green) / 0 flat
};
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
bool stockEverLoaded = false;
bool stockDirty = false;
bool stockChromeDrawn = false;
uint32_t stockLastCodeHash[MAX_STOCKS] = {}; // top line (code + CJK name strip)
uint32_t stockLastValHash[MAX_STOCKS] = {};  // value line (price + pct + direction)
unsigned long lastStockPollMs = 0;
// CJK names come as Mac-rendered RGB565 strips (GET /stock/names.raw, one
// 156x16 strip per row) - names_rev says when to re-fetch. -1 = not drawn.
const int STOCK_NAME_W = 156, STOCK_NAME_H = 16;
int stockNamesRev = -1;
int stockNamesDrawnRev = -1;

// ---------- full-screen K-line market mode ----------
// This is a separate page from the four-row stock page above. Unlike the
// ESP32-C3 implementation, the ESP8266 does not reserve a permanent 32 KB
// frame buffer. It allocates the compressed frame only during an update,
// validates the entire envelope and CRC, draws one row at a time through the
// existing 480-byte rowBuf, then immediately releases the allocation.
const unsigned long MARKET_POLL_INTERVAL_MS = 1000;
const unsigned long MARKET_HTTP_TIMEOUT_MS = 2500;
const unsigned long MARKET_READ_TIMEOUT_MS = 1200;
const unsigned long MARKET_TOTAL_TIMEOUT_MS = 5000;
const size_t MARKET_PACKED_HEADER_BYTES = 20;
const size_t MARKET_PACKED_MAX_BYTES = 30 * 1024;
const uint16_t MARKET_PALETTE_RGB565[16] PROGMEM = {
  0x0000, 0xFFFF, 0xC618, 0x7BEF, 0x39E7, 0x18C3, 0xF800, 0x07E0,
  0xFBE7, 0x37E7, 0xFFE0, 0xFD20, 0x07FF, 0x001F, 0xF81F, 0x8410
};
unsigned long lastMarketPollMs = 0;
uint64_t lastMarketFrameVersion = 0;
char lastMarketFrameSession[40] = "";
bool marketAutoDwellKnown = false;
unsigned long marketAutoDwellMs = 0;

// ---------- date/weather mode ----------
struct WeatherState {
  float currentTemp = 0;
  float todayHigh = 0, todayLow = 0;
  float tomorrowHigh = 0, tomorrowLow = 0;
  int currentCode = 0, todayCode = 0, tomorrowCode = 0;
  long utcOffsetSeconds = 8 * 3600;
  long scheduleUtcOffsetSeconds = 8 * 3600;
  time_t serverUnix = 0;
  unsigned long syncedAtMs = 0;
  bool valid = false;
  bool stale = true;
};
WeatherState weather;
unsigned long lastWeatherPollMs = 0;
unsigned long lastWeatherClockMs = 0;
bool weatherChromeDrawn = false;
bool weatherDirty = false;

char musicTitle[72] = "";
char musicArtist[48] = "";
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;
char bridgeVersion[24] = "--";

struct ClaudeStatus {
  char status[16] = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  char status[16] = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  int64_t weeklyResetAt = -1; // absolute Unix reset instant from the bridge
  int weeklyResetUtcOffsetSec = 0; // local offset at that instant (handles DST)
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

// Heap health is sampled from the normal loop, outside the diagnostic web
// request. This keeps the admin page's own temporary allocations out of the
// displayed "current" value and makes long-term fragmentation visible.
uint32_t idleFreeHeap = 0;
uint32_t minimumIdleFreeHeap = 0;
uint32_t idleMaxFreeBlock = 0;
uint8_t idleHeapFragmentation = 0;
unsigned long lastHeapSampleMs = 0;

void sampleHeapHealth(bool force = false) {
  const unsigned long now = millis();
  if (!force && now - lastHeapSampleMs < 1000UL) return;
  lastHeapSampleMs = now;
  idleFreeHeap = ESP.getFreeHeap();
  idleMaxFreeBlock = ESP.getMaxFreeBlockSize();
  idleHeapFragmentation = ESP.getHeapFragmentation();
  if (minimumIdleFreeHeap == 0 || idleFreeHeap < minimumIdleFreeHeap) {
    minimumIdleFreeHeap = idleFreeHeap;
  }
}

// ---------- Wi-Fi / bridge recovery diagnostics ----------
WiFiEventHandler wifiDisconnectedEventHandler;
WiFiEventHandler wifiGotIpEventHandler;
uint32_t wifiDisconnectCount = 0;
uint32_t wifiReconnectCount = 0;
uint8_t firstWifiDisconnectReason = 0;
uint8_t lastWifiDisconnectReason = 0;
int8_t firstWifiDisconnectRssi = 0;
uint8_t firstWifiDisconnectChannel = 0;
uint8_t firstWifiDisconnectBssid[6] = {};
bool firstDisconnectWasRecovery = false;
bool lastDisconnectWasRecovery = false;
bool wifiOutageActive = false;
uint16_t wifiRecoveryMask = 0;
uint32_t lastWifiOutageDurationMs = 0;
uint32_t quickRecoveryAtMs = 0;
uint32_t wifiReinitAtMs = 0;
uint32_t radioResetAtMs = 0;
uint32_t protectiveRestartAtMs = 0;
int8_t lastConnectedWifiRssi = 0;
uint8_t lastConnectedWifiChannel = 0;
uint8_t lastConnectedWifiBssid[6] = {};
RecoveryStep pendingDisconnectRecoveryStep = RECOVERY_NONE;
unsigned long pendingDisconnectRecoveryAtMs = 0;
unsigned long wifiDisconnectedSinceMs = 0;
bool wifiEverGotIp = false;
bool wifiSoftRecoveryDone = false;
bool wifiHardRecoveryDone = false;
bool wifiRadioRecoveryDone = false;
bool webServerNeedsRestart = false;

uint32_t bridgeConsecutiveFailures = 0;
uint32_t bridgeTotalFailures = 0;
int lastBridgeHttpCode = 0;
unsigned long bridgeFailureSinceMs = 0;
unsigned long lastBridgeSuccessAtMs = 0;
bool bridgeSoftRecoveryDone = false;
bool bridgeHardRecoveryDone = false;
char lastRecoveryAction[56] = "尚未执行";
unsigned long manualReconnectAtMs = 0;

void armRecoveryDisconnect(RecoveryStep step) {
  pendingDisconnectRecoveryStep = step;
  pendingDisconnectRecoveryAtMs = millis();
}

void sampleConnectedWifiEvidence() {
  if (WiFi.status() != WL_CONNECTED) return;
  lastConnectedWifiRssi = (int8_t)constrain(WiFi.RSSI(), -127, 0);
  lastConnectedWifiChannel = (uint8_t)WiFi.channel();
  const uint8_t *bssid = WiFi.BSSID();
  if (bssid) memcpy(lastConnectedWifiBssid, bssid, sizeof(lastConnectedWifiBssid));
}

