dinga1981/esp8266-ai/firmware/src/main.cpp
uint32_t currentWifiOutageDurationMs() {
  return wifiDisconnectedSinceMs == 0 ? lastWifiOutageDurationMs
                                      : millis() - wifiDisconnectedSinceMs;
}

void syncWifiEvidenceToRtc() {
  rtcRuntimeDiag.firstWifiDisconnectReason = firstWifiDisconnectReason;
  rtcRuntimeDiag.lastWifiDisconnectReason = lastWifiDisconnectReason;
  rtcRuntimeDiag.firstWifiRssi = firstWifiDisconnectRssi;
  rtcRuntimeDiag.firstWifiChannel = firstWifiDisconnectChannel;
  rtcRuntimeDiag.firstDisconnectWasRecovery = firstDisconnectWasRecovery ? 1 : 0;
  rtcRuntimeDiag.lastDisconnectWasRecovery = lastDisconnectWasRecovery ? 1 : 0;
  rtcRuntimeDiag.recoveryMask = wifiRecoveryMask;
  memcpy(rtcRuntimeDiag.firstWifiBssid, firstWifiDisconnectBssid,
         sizeof(rtcRuntimeDiag.firstWifiBssid));
  rtcRuntimeDiag.outageDurationMs = currentWifiOutageDurationMs();
  rtcRuntimeDiag.quickRecoveryAtMs = quickRecoveryAtMs;
  rtcRuntimeDiag.wifiReinitAtMs = wifiReinitAtMs;
  rtcRuntimeDiag.radioResetAtMs = radioResetAtMs;
  rtcRuntimeDiag.protectiveRestartAtMs = protectiveRestartAtMs;
}

void persistRecoverySnapshot(RecoveryStep step) {
  rtcRuntimeDiag.stage = STAGE_WIFI_RECOVERY;
  rtcRuntimeDiag.mode = diagnosticEffectiveMode;
  rtcRuntimeDiag.wifiStatus = (uint8_t)WiFi.status();
  rtcRuntimeDiag.recoveryStep = (uint8_t)step;
  const uint32_t elapsed = wifiDisconnectedSinceMs == 0 ? 0
                                                        : millis() - wifiDisconnectedSinceMs;
  wifiRecoveryMask |= (uint16_t)(1U << (uint8_t)step);
  if (step == RECOVERY_QUICK_RECONNECT) quickRecoveryAtMs = elapsed;
  else if (step == RECOVERY_WIFI_REINIT || step == RECOVERY_MANUAL) wifiReinitAtMs = elapsed;
  else if (step == RECOVERY_RADIO_RESET) radioResetAtMs = elapsed;
  else if (step == RECOVERY_PROTECTIVE_RESTART) protectiveRestartAtMs = elapsed;
  syncWifiEvidenceToRtc();
  rtcRuntimeDiag.bridgeFailures = bridgeConsecutiveFailures;
  rtcRuntimeDiag.wifiDisconnectCount = wifiDisconnectCount;
  rtcRuntimeDiag.wifiReconnectCount = wifiReconnectCount;
  rtcRuntimeDiag.lastBridgeHttpCode = lastBridgeHttpCode;
  rtcRuntimeDiag.millisAtStage = millis();
  writeRtcRuntimeDiag();
}

void setRecoveryAction(const char *action, RecoveryStep step) {
  strlcpy(lastRecoveryAction, action, sizeof(lastRecoveryAction));
  Serial.printf("[recovery] %s\n", lastRecoveryAction);
  persistRecoverySnapshot(step);
}

void recordBridgeSuccess() {
  lastBridgeSuccessAtMs = millis();
  bridgeConsecutiveFailures = 0;
  bridgeFailureSinceMs = 0;
  bridgeSoftRecoveryDone = false;
  bridgeHardRecoveryDone = false;
  rtcRuntimeDiag.recoveryStep = RECOVERY_NONE;
  rtcRuntimeDiag.bridgeFailures = 0;
  rtcRuntimeDiag.lastBridgeHttpCode = lastBridgeHttpCode;
}

void recordBridgeFailure(int code) {
  lastBridgeHttpCode = code;
  bridgeConsecutiveFailures++;
  bridgeTotalFailures++;
  rtcRuntimeDiag.bridgeFailures = bridgeConsecutiveFailures;
  rtcRuntimeDiag.lastBridgeHttpCode = lastBridgeHttpCode;
  if (bridgeFailureSinceMs == 0) bridgeFailureSinceMs = max(millis(), 1UL);
}

void hardReconnectWiFi(const char *reason, RecoveryStep step = RECOVERY_WIFI_REINIT) {
  setRecoveryAction(reason, step);
  armRecoveryDisconnect(step);
  WiFi.disconnect(false);
  WiFi.begin();
  webServerNeedsRestart = webServerStarted;
}

void resetWiFiRadio(const char *reason) {
  setRecoveryAction(reason, RECOVERY_RADIO_RESET);
  armRecoveryDisconnect(RECOVERY_RADIO_RESET);
  WiFi.forceSleepBegin();
  delay(30);
  WiFi.forceSleepWake();
  delay(30);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  WiFi.begin();
  webServerNeedsRestart = webServerStarted;
}

void maintainConnectivity(unsigned long nowMs) {
  if (!wifiEverGotIp && bridgeHost.length() == 0) return; // first-time config portal owns Wi-Fi
  sampleConnectedWifiEvidence();
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiDisconnectedSinceMs == 0) wifiDisconnectedSinceMs = max(nowMs, 1UL);
    const unsigned long downFor = nowMs - wifiDisconnectedSinceMs;
    if (downFor >= 15000UL && !wifiSoftRecoveryDone) {
      wifiSoftRecoveryDone = true;
      setRecoveryAction("Wi-Fi断线15秒：尝试快速重连", RECOVERY_QUICK_RECONNECT);
      armRecoveryDisconnect(RECOVERY_QUICK_RECONNECT);
      WiFi.reconnect();
    }
    if (downFor >= 60000UL && !wifiHardRecoveryDone) {
      wifiHardRecoveryDone = true;
      hardReconnectWiFi("Wi-Fi断线60秒：重新初始化无线网络");
    }
    if (downFor >= 180000UL && !wifiRadioRecoveryDone) {
      wifiRadioRecoveryDone = true;
      resetWiFiRadio("Wi-Fi断线3分钟：关闭并唤醒无线射频");
    }
    if (downFor >= 300000UL) {
      setRecoveryAction("Wi-Fi断线5分钟：保护性重启", RECOVERY_PROTECTIVE_RESTART);
      delay(20);
      ESP.restart();
    }
    return;
  }

  wifiDisconnectedSinceMs = 0;
  wifiSoftRecoveryDone = false;
  wifiHardRecoveryDone = false;
  wifiRadioRecoveryDone = false;

  // A bridge outage alone must never cause a reboot: the Mac may simply be
  // asleep. We make at most one soft and one full Wi-Fi recovery attempt per
  // failure episode, then keep polling until the bridge returns.
  if (bridgeFailureSinceMs != 0) {
    const unsigned long failedFor = nowMs - bridgeFailureSinceMs;
    if (failedFor >= 30000UL && !bridgeSoftRecoveryDone) {
      bridgeSoftRecoveryDone = true;
      setRecoveryAction("桥接失败30秒：尝试快速重连", RECOVERY_QUICK_RECONNECT);
      armRecoveryDisconnect(RECOVERY_QUICK_RECONNECT);
      WiFi.reconnect();
    }
    if (failedFor >= 90000UL && !bridgeHardRecoveryDone) {
      bridgeHardRecoveryDone = true;
      hardReconnectWiFi("桥接失败90秒：重新初始化无线网络");
    }
  }
}

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100

void applyBrightness() {
  // analogWriteRange(100) is set in setup(), so the duty value is just the
  // inverted percentage (active LOW: 0 duty = always LOW = full on).
  analogWrite(TFT_BL, 100 - brightness);
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

bool validAutoCycleSeconds(int seconds) {
  return seconds == 5 || seconds == 10 || seconds == 15 || seconds == 20 ||
         seconds == 30 || seconds == 60 || seconds == 120;
}

