dinga1981/esp8266-ai/firmware/src/main.cpp
const uint16_t VISIBLE_AUTO_MASK =
    (1U << MODE_CODEX) | (1U << MODE_MUSIC) | (1U << MODE_STOCK) |
    (1U << MODE_MARKET) | (1U << MODE_WEATHER);

time_t weatherLocalEpoch() {
  if (weather.serverUnix <= 0) return 0;
  return weather.serverUnix + (time_t)((millis() - weather.syncedAtMs) / 1000UL) +
         (time_t)weather.utcOffsetSeconds;
}

bool weatherIsWeekend() {
  if (weather.serverUnix <= 0) return false;
  time_t localEpoch = weather.serverUnix +
      (time_t)((millis() - weather.syncedAtMs) / 1000UL) +
      (time_t)weather.scheduleUtcOffsetSeconds;
  if (localEpoch <= 0) return false; // before first sync, use weekday schedule
  struct tm localTm;
  gmtime_r(&localEpoch, &localTm);
  return localTm.tm_wday == 0 || localTm.tm_wday == 6;
}

uint16_t activeAutoPageMask() {
  return weatherIsWeekend() ? weekendAutoPageMask : weekdayAutoPageMask;
}

uint16_t activeAutoCycleSeconds() {
  return weatherIsWeekend() ? weekendAutoCycleSeconds : weekdayAutoCycleSeconds;
}

uint8_t selectedAutoPageCount() {
  uint8_t count = 0;
  const uint16_t mask = activeAutoPageMask();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (mask & (1U << mode)) ++count;
  }
  return count;
}

DisplayMode autoPageAt(uint8_t selectedIndex) {
  uint8_t found = 0;
  const uint16_t mask = activeAutoPageMask();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (!(mask & (1U << mode))) continue;
    if (found++ == selectedIndex) return (DisplayMode)mode;
  }
  return MODE_CODEX;
}

void loadAutoCycle() {
  if (!LittleFS.exists(AUTO_CYCLE_FILE)) return;
  File f = LittleFS.open(AUTO_CYCLE_FILE, "r");
  if (!f) return;
  const int weekdayMask = f.readStringUntil('\n').toInt();
  const int weekdaySeconds = f.readStringUntil('\n').toInt();
  String weekendMaskLine = f.readStringUntil('\n');
  String weekendSecondsLine = f.readStringUntil('\n');
  f.close();
  uint16_t cleanWeekday = (uint16_t)weekdayMask & VISIBLE_AUTO_MASK;
  if (cleanWeekday == 0) cleanWeekday = 1U << MODE_CODEX;
  weekdayAutoPageMask = cleanWeekday;
  if (validAutoCycleSeconds(weekdaySeconds)) weekdayAutoCycleSeconds = weekdaySeconds;

  // v0.5.5 stored only two lines. Duplicate that schedule for the weekend
  // when upgrading, so existing users keep the same behavior until editing it.
  if (weekendMaskLine.length() == 0) {
    weekendAutoPageMask = weekdayAutoPageMask;
    weekendAutoCycleSeconds = weekdayAutoCycleSeconds;
  } else {
    uint16_t cleanWeekend = (uint16_t)weekendMaskLine.toInt() & VISIBLE_AUTO_MASK;
    if (cleanWeekend == 0) cleanWeekend = 1U << MODE_CODEX;
    weekendAutoPageMask = cleanWeekend;
    const int weekendSeconds = weekendSecondsLine.toInt();
    if (validAutoCycleSeconds(weekendSeconds)) weekendAutoCycleSeconds = weekendSeconds;
  }
}

void saveAutoCycle() {
  File f = LittleFS.open(AUTO_CYCLE_FILE, "w");
  if (!f) return;
  f.println(weekdayAutoPageMask);
  f.println(weekdayAutoCycleSeconds);
  f.println(weekendAutoPageMask);
  f.println(weekendAutoCycleSeconds);
  f.close();
}

void resetAutoCyclePosition() {
  autoPageIndex = 0;
  autoPageStartedMs = millis();
  lastAutoScheduleWeekend = weatherIsWeekend();
}

void advanceAutoCycleIfNeeded(unsigned long nowMs) {
  if (displayMode != MODE_AUTO) return;
  const bool weekend = weatherIsWeekend();
  if (weekend != lastAutoScheduleWeekend) {
    lastAutoScheduleWeekend = weekend;
    autoPageIndex = 0;
    autoPageStartedMs = nowMs;
    lastEffectiveMode = MODE_AUTO;
  }
  const uint8_t count = selectedAutoPageCount();
  if (count == 0) return;
  unsigned long dwellMs = (unsigned long)activeAutoCycleSeconds() * 1000UL;
  if (autoPageAt(autoPageIndex) == MODE_MARKET) {
    // Give the bridge a short grace period to report its favorite count and
    // K-line rotation cadence. Once known, keep this page for one complete
    // favorite round instead of cutting it off at the outer page interval.
    if (!marketAutoDwellKnown && nowMs - autoPageStartedMs < 3000UL) return;
    if (marketAutoDwellKnown && marketAutoDwellMs > dwellMs) dwellMs = marketAutoDwellMs;
  }
  if (nowMs - autoPageStartedMs >= dwellMs) {
    autoPageIndex = (autoPageIndex + 1) % count;
    autoPageStartedMs = nowMs;
  }
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CLAUDE_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

  codexCustom = false;
  if (LittleFS.exists(CODEX_SPRITE_FILE)) {
    File f = LittleFS.open(CODEX_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CODEX_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        codexCustom = true;
        codexCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

  Serial.printf("[sprite] claude custom=%d frames=%d | codex custom=%d frames=%d\n", claudeCustom,
                claudeCustomFrames, codexCustom, codexCustomFrames);
}

int claudeFrameCount() { return claudeCustom ? claudeCustomFrames : CLAUDE_SPRITE_FRAMES; }
int codexFrameCount() { return codexCustom ? codexCustomFrames : CODEX_SPRITE_FRAMES; }

// Draws one sprite frame centered on screen, one row at a time so we never
// need a full-frame buffer: each row comes either from the custom LittleFS
// file (streamed) or the compiled-in PROGMEM default (copied row-by-row).
void drawSpriteFrame(bool custom, const char *file, const uint16_t *const *progmemFrames, int frameIdx, int w,
                     int h, size_t frameBytes) {
  int x0 = SCREEN_CX - w / 2, y0 = SCREEN_CY - h / 2;
  size_t rowBytes = (size_t)w * 2;
  if (custom) {
    File f = LittleFS.open(file, "r");
    if (!f) return;
    f.seek(1 + (size_t)frameIdx * frameBytes);
    for (int r = 0; r < h; r++) {
      f.read((uint8_t *)rowBuf, rowBytes);
      tft.pushImage(x0, y0 + r, w, 1, rowBuf);
    }
    f.close();
  } else {
    const uint16_t *frame = progmemFrames[frameIdx];
    for (int r = 0; r < h; r++) {
      memcpy_P(rowBuf, frame + (size_t)r * w, rowBytes);
      tft.pushImage(x0, y0 + r, w, 1, rowBuf);
    }
  }
}

// ---------- helpers ----------

String formatTokens(long tokens) {
  if (tokens >= 1000000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fM", tokens / 1000000.0);
    return String(buf);
  }
  if (tokens >= 1000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fk", tokens / 1000.0);
    return String(buf);
  }
  return String(tokens);
}

// ---------- drawing ----------

void drawStaticChrome() {
  tft.fillScreen(TFT_BLACK);
}

// Bridge unreachable / data stale -> flashing red overrides everything else,
// matches the "urgent, look now" state from the reference signal-light design.
bool bridgeStale() {
  if (!everPolled) return true;
  return (millis() - lastSuccessMs) >= 2UL * BRIDGE_POLL_INTERVAL_MS;
}

// True when the app currently on screen is waiting on a permission/approval
// prompt — drives the red "look now, act" border flash.
bool currentAppNeedsInput() {
  return currentApp == APP_CLAUDE ? claudeStatus.needsInput : codexStatus.needsInput;
}

// Working vs idle is now conveyed by the sprite animation itself (moving vs
// still), not by ring color. The ring just stays steady green, except
// bridge-stale which flashes red ("check it now") and overrides everything.
uint16_t currentStatusColor() {
  if (bridgeStale()) return flashOn ? TFT_RED : TFT_BLACK;
  return TFT_GREEN;
}

// The ring is skipped when nothing changed (see drawSquareRing) so the 5s
// poll doesn't visibly blank-and-repaint it. Anything that paints over the
// ring area must invalidate this cache.
float ringLastPct = -1000;
uint16_t ringLastColor = 1;

