dinga1981/esp8266-ai/firmware/src/main.cpp
// Chinese city/date/condition labels are rendered by AppKit on the Mac and
// streamed as five small RGB565 strips, avoiding a multi-hundred-KB CJK font
// in ESP8266 flash.
bool drawWeatherChineseText() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, "http://" + bridgeHost + "/weather/text.raw")) return false;
  if (http.GET() != HTTP_CODE_OK) { http.end(); return false; }
  WiFiClient *stream = http.getStreamPtr();
  bool ok = drawWeatherTextStrip(stream, 0, 0, 108, 32) &&
            drawWeatherTextStrip(stream, 108, 0, 132, 32) &&
            drawWeatherTextStrip(stream, 107, 139, 130, 22) &&
            drawWeatherTextStrip(stream, 42, 177, 78, 28) &&
            drawWeatherTextStrip(stream, 162, 177, 78, 28);
  http.end();
  return ok;
}

void drawWeatherScreen(bool force) {
  if (force || !weatherChromeDrawn) {
    weatherChromeDrawn = true;
    tft.fillScreen(TFT_BLACK);
    const uint16_t divider = tft.color565(41, 70, 95);
    const uint16_t footer = tft.color565(9, 19, 29);
    tft.drawFastHLine(0, 32, SCREEN_W, divider);
    tft.fillRect(0, 168, SCREEN_W, 72, footer);
    tft.drawFastHLine(0, 168, SCREEN_W, divider);
    tft.drawFastVLine(120, 168, 72, divider);
    weatherDirty = true;
  }
  drawWeatherClock();
  if (!weatherDirty) return;
  weatherDirty = false;
  tft.fillRect(0, 77, SCREEN_W, 90, TFT_BLACK);
  drawWeatherIcon(69, 119, 56, weather.currentCode);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  String current = weather.valid ? String((int)round(weather.currentTemp)) : "--";
  tft.drawString(current, 108, 92, 6);
  int tempWidth = tft.textWidth(current, 6);
  tft.drawCircle(112 + tempWidth, 98, 3, TFT_WHITE);
  tft.drawString("C", 119 + tempWidth, 105, 4);

  const uint16_t footer = tft.color565(9, 19, 29);
  const uint16_t warm = tft.color565(255, 180, 95);
  const uint16_t cool = tft.color565(119, 207, 255);
  tft.fillRect(1, 169, 118, 70, footer);
  tft.fillRect(121, 169, 119, 70, footer);
  for (int day = 0; day < 2; ++day) {
    const int x = day * 120;
    const int code = day == 0 ? weather.todayCode : weather.tomorrowCode;
    const float high = day == 0 ? weather.todayHigh : weather.tomorrowHigh;
    const float low = day == 0 ? weather.todayLow : weather.tomorrowLow;
    drawWeatherIcon(x + 27, 203, 31, code);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(warm, footer);
    tft.drawString(weather.valid ? String((int)round(high)) : "--", x + 49, 207, 2);
    tft.setTextColor(TFT_LIGHTGREY, footer);
    tft.drawString("/", x + 76, 207, 2);
    tft.setTextColor(cool, footer);
    tft.drawString(weather.valid ? String((int)round(low)) : "--", x + 87, 207, 2);
  }
  drawWeatherChineseText();
}

// ---------- full-screen K-line frame ----------

bool readMarketExact(WiFiClient *stream, uint8_t *dst, size_t length,
                     unsigned long timeoutMs) {
  size_t received = 0;
  unsigned long deadline = millis() + timeoutMs;
  while (received < length) {
    int available = stream->available();
    if (available > 0) {
      size_t want = min((size_t)available, length - received);
      int got = stream->read(dst + received, want);
      if (got > 0) {
        received += (size_t)got;
        continue;
      }
    }
    if ((long)(millis() - deadline) >= 0) return false;
    delay(1);
    yield();
  }
  return true;
}

uint32_t marketCrc32(const uint8_t *data, size_t length) {
  uint32_t crc = 0xFFFFFFFF;
  for (size_t i = 0; i < length; ++i) {
    crc ^= data[i];
    for (int bit = 0; bit < 8; ++bit) {
      crc = (crc >> 1) ^ ((crc & 1U) ? 0xEDB88320U : 0U);
    }
  }
  return ~crc;
}

uint64_t marketReadU64BE(const uint8_t *data) {
  uint64_t value = 0;
  for (int i = 0; i < 8; ++i) value = (value << 8) | data[i];
  return value;
}

uint32_t marketReadU32BE(const uint8_t *data) {
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

// Validate every byte and the decoded pixel count before the TFT is touched.
// A short/corrupt/oversized download therefore leaves the prior page intact.
bool validateMarketFrame(const uint8_t *frame, size_t frameBytes,
                         uint64_t expectedVersion, uint64_t &versionOut) {
  if (frameBytes < MARKET_PACKED_HEADER_BYTES) return false;
  const bool palette4 = memcmp(frame, "MKT2", 4) == 0;
  if (!palette4 && memcmp(frame, "MKT1", 4) != 0) return false;
  const uint16_t width = ((uint16_t)frame[12] << 8) | frame[13];
  const uint16_t height = ((uint16_t)frame[14] << 8) | frame[15];
  if (width != SCREEN_W || height != SCREEN_H) return false;
  const uint64_t version = marketReadU64BE(frame + 4);
  if (version < expectedVersion || version <= lastMarketFrameVersion) return false;
  const uint8_t *payload = frame + MARKET_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - MARKET_PACKED_HEADER_BYTES;
  if (marketCrc32(payload, payloadBytes) != marketReadU32BE(frame + 16)) return false;

  size_t cursor = 0, pixels = 0;
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    const size_t count = (control & 0x7F) + 1;
    const bool repeated = control & 0x80;
    const size_t encoded = palette4 ? (repeated ? 1 : (count + 1) / 2)
                                    : (repeated ? 2 : count * 2);
    if (cursor + encoded > payloadBytes || pixels + count > SCREEN_W * SCREEN_H) return false;
    if (palette4 && repeated && payload[cursor] >= 16) return false;
    cursor += encoded;
    pixels += count;
  }
  if (pixels != SCREEN_W * SCREEN_H) return false;
  versionOut = version;
  return true;
}

void drawMarketFrame(const uint8_t *frame, size_t frameBytes) {
  const uint8_t *payload = frame + MARKET_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - MARKET_PACKED_HEADER_BYTES;
  uint8_t *rowBytes = reinterpret_cast<uint8_t *>(rowBuf);
  size_t cursor = 0, rowPixels = 0;
  int y = 0;
  const bool palette4 = memcmp(frame, "MKT2", 4) == 0;
  tft.startWrite();
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    size_t count = (control & 0x7F) + 1;
    const bool repeated = control & 0x80;
    uint8_t high = 0, low = 0, paletteIndex = 0, packedIndexes = 0;
    if (repeated) {
      if (palette4) paletteIndex = payload[cursor++];
      else { high = payload[cursor++]; low = payload[cursor++]; }
    }
    size_t item = 0;
    while (count-- > 0) {
      if (palette4) {
        if (!repeated && (item & 1U) == 0) packedIndexes = payload[cursor++];
        const uint8_t index = repeated ? paletteIndex
                                       : ((item & 1U) ? packedIndexes & 0x0F : packedIndexes >> 4);
        const uint16_t color = pgm_read_word(&MARKET_PALETTE_RGB565[index]);
        rowBytes[rowPixels * 2] = (uint8_t)(color >> 8);
        rowBytes[rowPixels * 2 + 1] = (uint8_t)color;
      } else {
        rowBytes[rowPixels * 2] = repeated ? high : payload[cursor++];
        rowBytes[rowPixels * 2 + 1] = repeated ? low : payload[cursor++];
      }
      item++;
      if (++rowPixels == SCREEN_W) {
        tft.pushImage(0, y++, SCREEN_W, 1, rowBuf);
        rowPixels = 0;
        yield();
      }
    }
  }
  tft.endWrite();
}

