dinga1981/esp8266-ai/firmware/src/main.cpp
bool fetchMarketFrame(uint64_t expectedVersion, size_t advertisedBytes, bool palette4) {
  saveRuntimeStage(STAGE_MARKET_FRAME);
  if (advertisedBytes < MARKET_PACKED_HEADER_BYTES ||
      advertisedBytes > MARKET_PACKED_MAX_BYTES) return false;
  // Leave enough contiguous heap for HTTP/TCP and the rest of the firmware.
  if (ESP.getMaxFreeBlockSize() < advertisedBytes + 6144) {
    Serial.printf("[market] insufficient heap frame=%u maxblock=%u\n",
                  (unsigned)advertisedBytes, ESP.getMaxFreeBlockSize());
    return false;
  }
  uint8_t *frame = (uint8_t *)malloc(advertisedBytes);
  if (!frame) return false;

  WiFiClient client;
  client.setTimeout(MARKET_READ_TIMEOUT_MS);
  HTTPClient http;
  String url = "http://" + bridgeHost + (palette4 ? "/market/frame.pal" : "/market/frame.rle");
  http.setTimeout(MARKET_HTTP_TIMEOUT_MS);
  bool ok = false;
  if (http.begin(client, url)) {
    const int code = http.GET();
    const int actualBytes = http.getSize();
    if (code == HTTP_CODE_OK && actualBytes == (int)advertisedBytes) {
      WiFiClient *stream = http.getStreamPtr();
      if (readMarketExact(stream, frame, advertisedBytes, MARKET_TOTAL_TIMEOUT_MS)) {
        uint64_t version = 0;
        if (validateMarketFrame(frame, advertisedBytes, expectedVersion, version)) {
          drawMarketFrame(frame, advertisedBytes);
          lastMarketFrameVersion = version;
          ok = true;
          Serial.printf("[market] applied version=%llu bytes=%u heap=%u\n",
                        (unsigned long long)version, (unsigned)advertisedBytes,
                        ESP.getFreeHeap());
        }
      }
    }
    http.end();
  }
  free(frame);
  if (!ok) Serial.println("[market] frame rejected; keeping previous screen");
  return ok;
}

void pollMarket() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/market/version";
  http.setTimeout(MARKET_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  const int code = http.GET();
  if (code != HTTP_CODE_OK) { http.end(); return; }
  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, *http.getStreamPtr());
  http.end();
  if (err) return;
  const char *session = doc["session"] | "";
  const int favoriteCount = doc["favorite_count"] | 0;
  const int refreshSeconds = doc["refresh_seconds"] | 0;
  if (favoriteCount > 0 && favoriteCount <= 15 &&
      (refreshSeconds == 5 || refreshSeconds == 10 || refreshSeconds == 30 ||
       refreshSeconds == 60 || refreshSeconds == 120)) {
    marketAutoDwellMs = (unsigned long)favoriteCount * (unsigned long)refreshSeconds * 1000UL;
    marketAutoDwellKnown = true;
  }
  if (session[0] != '\0' && strcmp(lastMarketFrameSession, session) != 0) {
    strlcpy(lastMarketFrameSession, session, sizeof(lastMarketFrameSession));
    lastMarketFrameVersion = 0;
  }
  const uint64_t version = doc["version"] | (uint64_t)0;
  const char *paletteCodec = doc["palette_codec"] | "";
  const size_t paletteBytes = doc["palette_bytes"] | (size_t)0;
  const char *legacyCodec = doc["codec"] | "";
  const size_t legacyBytes = doc["packed_bytes"] | (size_t)0;
  if (version > lastMarketFrameVersion) {
    if (strcmp(paletteCodec, "rgb565-palette4-rle-v1") == 0 && paletteBytes > 0) {
      fetchMarketFrame(version, paletteBytes, true);
    } else if (strcmp(legacyCodec, "rgb565-packbits-v1") == 0) {
      fetchMarketFrame(version, legacyBytes, false);
    }
  }
}

// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // global: the config portal now runs non-blocking in loop()

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or: plug into the computer", 8, 155, 2);
  tft.drawString("via USB - no WiFi needed", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

// Non-blocking: with saved credentials this still waits ~10s for the join,
// but a missing/failed WiFi no longer traps boot in the portal - the portal
// keeps running from loop() while the USB serial link can take over the
// screen (wired mode for APs with client isolation).
void setupWiFi() {
  wifiDisconnectedEventHandler = WiFi.onStationModeDisconnected(
      [](const WiFiEventStationModeDisconnected &event) {
        const unsigned long now = millis();
        const bool recoveryGenerated = pendingDisconnectRecoveryStep != RECOVERY_NONE &&
            now - pendingDisconnectRecoveryAtMs <= 5000UL;
        wifiDisconnectCount++;
        lastWifiDisconnectReason = (uint8_t)event.reason;
        lastDisconnectWasRecovery = recoveryGenerated;
        if (wifiEverGotIp && !wifiOutageActive) {
          wifiOutageActive = true;
          firstWifiDisconnectReason = lastWifiDisconnectReason;
          firstWifiDisconnectRssi = lastConnectedWifiRssi;
          firstWifiDisconnectChannel = lastConnectedWifiChannel;
          memcpy(firstWifiDisconnectBssid, lastConnectedWifiBssid,
                 sizeof(firstWifiDisconnectBssid));
          firstDisconnectWasRecovery = recoveryGenerated;
          if (!recoveryGenerated) {
            wifiRecoveryMask = 0;
            quickRecoveryAtMs = wifiReinitAtMs = radioResetAtMs = protectiveRestartAtMs = 0;
          }
          lastWifiOutageDurationMs = 0;
        }
        if (wifiDisconnectedSinceMs == 0) wifiDisconnectedSinceMs = max(now, 1UL);
        syncWifiEvidenceToRtc();
        rtcRuntimeDiag.wifiDisconnectCount = wifiDisconnectCount;
        rtcRuntimeDiag.wifiStatus = WL_DISCONNECTED;
        writeRtcRuntimeDiag();
        Serial.printf("[wifi] disconnected reason=%u source=%s count=%lu\n",
                      (unsigned)lastWifiDisconnectReason,
                      recoveryGenerated ? "recovery" : "external/stack",
                      (unsigned long)wifiDisconnectCount);
      });
  wifiGotIpEventHandler = WiFi.onStationModeGotIP(
      [](const WiFiEventStationModeGotIP &event) {
        if (wifiEverGotIp) wifiReconnectCount++;
        wifiEverGotIp = true;
        if (wifiOutageActive && wifiDisconnectedSinceMs != 0) {
          lastWifiOutageDurationMs = millis() - wifiDisconnectedSinceMs;
        }
        wifiOutageActive = false;
        pendingDisconnectRecoveryStep = RECOVERY_NONE;
        pendingDisconnectRecoveryAtMs = 0;
        wifiDisconnectedSinceMs = 0;
        wifiSoftRecoveryDone = false;
        wifiHardRecoveryDone = false;
        wifiRadioRecoveryDone = false;
        rtcRuntimeDiag.recoveryStep = RECOVERY_NONE;
        syncWifiEvidenceToRtc();
        rtcRuntimeDiag.wifiReconnectCount = wifiReconnectCount;
        rtcRuntimeDiag.wifiStatus = WL_CONNECTED;
        writeRtcRuntimeDiag();
        lastPollMs = 0;
        webServerNeedsRestart = webServerStarted;
        Serial.printf("[wifi] got ip=%s reconnects=%lu\n", event.ip.toString().c_str(),
                      (unsigned long)wifiReconnectCount);
      });
  WiFi.setAutoReconnect(true);
  // This clock is continuously powered. Disabling modem sleep avoids a class
  // of long-idle association/ARP failures seen with some routers and costs
  // only additional power, not display functionality.
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

