dinga1981/esp8266-ai/firmware/src/main.cpp
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("Connecting WiFi...", 8, 100, 2);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  WiFi.setAutoReconnect(true);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

bool applyStatusJson(JsonDocument &doc) {
  strlcpy(bridgeVersion, doc["bridge_version"] | "--", sizeof(bridgeVersion));

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    strlcpy(claudeStatus.status, c["status"] | "unknown", sizeof(claudeStatus.status));
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    strlcpy(codexStatus.status, x["status"] | "unknown", sizeof(codexStatus.status));
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.weeklyResetAt = x["weekly_reset_at"] | (int64_t)-1;
    codexStatus.weeklyResetUtcOffsetSec = x["weekly_reset_utc_offset_sec"] | 0;
    codexStatus.needsInput = x["needs_input"] | false;
  }
  statusMusicPlaying = doc["music_playing"] | false;
  return true;
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  return !deserializeJson(doc, payload) && applyStatusJson(doc);
}

// The mode actually rendered. AUTO selects exactly one configured carousel
// page; the fixed-page modes keep their original behavior.
DisplayMode effectiveMode() {
  if (displayMode == MODE_AUTO) {
    const uint8_t count = selectedAutoPageCount();
    if (count == 0) return MODE_CODEX;
    if (autoPageIndex >= count) autoPageIndex = 0;
    return autoPageAt(autoPageIndex);
  }
  return displayMode;
}

bool selectEffectivePet(DisplayMode eff) {
  if (eff == MODE_CLAUDE) {
    const bool changed = currentApp != APP_CLAUDE;
    currentApp = APP_CLAUDE;
    return changed;
  }
  if (eff == MODE_CODEX) {
    const bool changed = currentApp != APP_CODEX;
    currentApp = APP_CODEX;
    return changed;
  }
  return updateActiveApp();
}

void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  saveRuntimeStage(STAGE_BRIDGE);
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    recordBridgeFailure(-1001);
    saveRuntimeStage(STAGE_IDLE);
    return;
  }
  int code = http.GET();
  lastBridgeHttpCode = code;
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    JsonDocument doc;
    if (!deserializeJson(doc, *http.getStreamPtr()) && applyStatusJson(doc)) {
      lastSuccessMs = millis();
      everPolled = true;
      recordBridgeSuccess();
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status, claudeStatus.tokensToday,
                    codexStatus.status, codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
      recordBridgeFailure(-1002);
    }
  } else {
    recordBridgeFailure(code);
    strlcpy(claudeStatus.status, "offline", sizeof(claudeStatus.status));
    strlcpy(codexStatus.status, "offline", sizeof(codexStatus.status));
  }
  http.end();
  saveRuntimeStage(STAGE_IDLE);
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK &&
      eff != MODE_MARKET && eff != MODE_WEATHER) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (selectEffectivePet(eff)) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- wired (USB serial) bridge link ----------
// Fallback for WiFi networks with client isolation (device can't reach the
// bridge over LAN) - or for skipping WiFi setup entirely: when the clock is
// plugged into the computer over USB, the bridge pushes the same /status and
// /net payloads down the CH340 serial line as newline-terminated frames:
//   bridge -> device:  #HELLO   #STATUS {json}   #NET {json}   #CMD {json}
//   device -> bridge:  #DEVICE {"name":"aiclock","fw":"x.y.z"}
// Everything else the device prints (logs) is ignored by the bridge.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600]; // biggest frame is #STATUS at ~600 bytes
size_t serialLineLen = 0;

bool wiredActive() { return wiredEverLinked && (millis() - lastSerialFrameMs) < 15000UL; }

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  if (displayMode == MODE_AUTO) resetAutoCyclePosition();
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6)) {
    Serial.printf("#DEVICE {\"name\":\"aiclock\",\"fw\":\"%s\"}\n", FW_VERSION);
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    if (parseStatusJson(String(line + 8))) {
      lastSuccessMs = millis();
      everPolled = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK &&
          eff != MODE_MARKET && eff != MODE_WEATHER) {
        if (selectEffectivePet(eff)) drawActiveApp();
        else refreshActiveApp();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#STOCK ", 7)) {
    handleStockPayload(String(line + 7));
    return;
  }
  if (!strncmp(line, "#WEATHER ", 9)) {
    handleWeatherPayload(String(line + 9));
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
    }
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      String m(mode);
      if (m == "auto") { displayMode = MODE_AUTO; resetAutoCyclePosition(); lastEffectiveMode = MODE_AUTO; }
      else if (m == "claude") displayMode = MODE_CLAUDE;
      else if (m == "codex") displayMode = MODE_CODEX;
      else if (m == "net") displayMode = MODE_NET;
      else if (m == "music") displayMode = MODE_MUSIC;
      else if (m == "stock") displayMode = MODE_STOCK;
      else if (m == "market") displayMode = MODE_MARKET;
      else if (m == "weather") displayMode = MODE_WEATHER;
      // the effectiveMode transition handler in loop() repaints the chrome
    }
    return;
  }
}

