dinga1981/esp8266-ai/firmware/src/main.cpp
// Drains the UART, splitting on newlines; frames start with '#', everything
// else (line noise, echoes) is dropped.
void pumpSerial() {
  while (Serial.available()) {
    char ch = (char)Serial.read();
    if (ch == '\n' || ch == '\r') {
      if (serialLineLen > 0 && serialLine[0] == '#') {
        serialLine[serialLineLen] = 0;
        handleSerialFrame(serialLine);
      }
      serialLineLen = 0;
    } else if (serialLineLen < sizeof(serialLine) - 1) {
      serialLine[serialLineLen++] = ch;
    } else {
      serialLineLen = 0; // oversized line: drop it
    }
  }
}

// ---------- web admin ----------

String htmlEscape(const String &s) {
  String out = s;
  out.replace("&", "&amp;");
  out.replace("<", "&lt;");
  out.replace(">", "&gt;");
  out.replace("\"", "&quot;");
  return out;
}

void handleRoot() {
  saveRuntimeStage(STAGE_WEB);
  // Chunk the page directly from flash instead of building one multi-KB
  // String on the ESP8266 heap.
  webServer.setContentLength(CONTENT_LENGTH_UNKNOWN);
  webServer.send(200, "text/html; charset=utf-8", "");
  webServer.sendContent_P(PSTR(
      "<!DOCTYPE html><html><head><meta charset='utf-8'>"
      "<meta name='viewport' content='width=device-width,initial-scale=1'>"
      "<title>AI Clock 设置</title><style>"
      "body{font-family:-apple-system,sans-serif;max-width:480px;margin:24px auto;padding:0 16px;color:#222}"
      "h1{font-size:20px}label{display:block;margin-top:16px;font-weight:600}"
      "input{width:100%;box-sizing:border-box;padding:8px;font-size:16px;margin-top:4px}"
      "button{margin-top:16px;padding:10px 20px;font-size:16px;background:#2563eb;color:#fff;border:0;border-radius:6px}"
      "table{margin-top:20px;border-collapse:collapse;width:100%}"
      "td{padding:4px 8px;border-bottom:1px solid #eee;font-size:14px}"
      "</style></head><body><h1>AI Clock 设置</h1>"
      "<form method='POST' action='/save'><label>Bridge host (ip:port)</label>"
      "<input name='bridge' value='"));
  webServer.sendContent(htmlEscape(bridgeHost));
  webServer.sendContent_P(PSTR("' placeholder='192.168.1.181:8765'><button type='submit'>保存</button></form>"
      "<h2 style='font-size:16px;margin-top:28px'>屏幕亮度</h2>"
      "<input type='range' min='0' max='100' value='"));
  webServer.sendContent(String(brightness));
  webServer.sendContent_P(PSTR("' id='bri' oninput=\"document.getElementById('briv').textContent=this.value+'%'\" "
      "onchange=\"fetch('/api/brightness',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'level='+this.value})\">"
      "<div style='font-size:13px;color:#555'>当前：<span id='briv'>"));
  webServer.sendContent(String(brightness));
  webServer.sendContent_P(PSTR("%</span>（0 = 熄屏，设置立即生效并记住）</div>"
      "<h2 style='font-size:16px;margin-top:28px'>桌宠动画（上传 GIF）</h2>"
      "<p style='font-size:13px;color:#555'>上传一个 .gif，设备会在板上解码并缩放到对应角色的尺寸，"
      "立刻替换动画，无需重新编译或烧录。GIF 太大可能因内存不足解码失败，换小一点的即可。</p>"
      "<form id='gifForm' method='POST' enctype='multipart/form-data' onsubmit='return setGifAction()'>"
      "<label>角色</label><select id='gifTarget'><option value='claude'>Claude</option>"
      "<option value='codex'>Codex</option></select><label>GIF 文件</label>"
      "<input type='file' name='file' accept='.gif' required><button type='submit'>上传并应用</button></form>"
      "<script>function setGifAction(){document.getElementById('gifForm').action='/sprite/'+"
      "document.getElementById('gifTarget').value;return true}</script>"
      "<h2 style='font-size:16px;margin-top:28px'>设备诊断</h2><table>"
      "<tr><td>Wi-Fi 名称</td><td>"));
  webServer.sendContent(htmlEscape(WiFi.SSID()));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>Wi-Fi 信号</td><td>"));
  webServer.sendContent(String(WiFi.RSSI()) + " dBm");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>设备 IP</td><td>"));
  webServer.sendContent(WiFi.localIP().toString());
  webServer.sendContent_P(PSTR("</td></tr><tr><td>桥接状态</td><td>"));
  webServer.sendContent(wiredActive() ? "在线（USB）" :
      (everPolled && millis() - lastSuccessMs < 30000UL ? "在线（局域网）" : "离线"));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>上次数据更新</td><td>"));
  webServer.sendContent(everPolled ? String((millis() - lastSuccessMs) / 1000) + " 秒前" : "从未");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>固件版本</td><td>" FW_VERSION
      "</td></tr><tr><td>桥接版本</td><td>"));
  webServer.sendContent(htmlEscape(bridgeVersion));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>本次启动原因</td><td>"));
  webServer.sendContent(htmlEscape(lastResetReason));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>累计启动次数</td><td>"));
  webServer.sendContent(String(bootCount));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前运行位置</td><td>"));
  webServer.sendContent(String(runtimeStageName(previousRuntimeStage)) + " / " +
                        runtimeModeName(previousRuntimeMode));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前恢复步骤</td><td>"));
  webServer.sendContent(recoveryStepName(previousRecoveryStep));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前首次断线</td><td>"));
  webServer.sendContent(disconnectEventText(previousFirstWifiDisconnectReason,
                                            previousFirstDisconnectWasRecovery));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前最后断线</td><td>"));
  webServer.sendContent(disconnectEventText(previousLastWifiDisconnectReason,
                                            previousLastDisconnectWasRecovery));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>首次断线前无线环境</td><td>"));
  webServer.sendContent(previousFirstWifiDisconnectReason == 0 ? "无记录" :
                        String(previousFirstWifiRssi) + " dBm / 信道 " +
                        String(previousFirstWifiChannel) + " / " +
                        wifiBssidText(previousFirstWifiBssid));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前断线时长</td><td>"));
  webServer.sendContent(String(previousOutageDurationMs / 1000UL) + " 秒");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前恢复时间线</td><td>"));
  webServer.sendContent(recoveryTimelineText(previousQuickRecoveryAtMs,
                        previousWifiReinitAtMs, previousRadioResetAtMs,
                        previousProtectiveRestartAtMs));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前断线 / 重连</td><td>"));
  webServer.sendContent(String(previousWifiDisconnectCount) + " / " +
                        String(previousWifiReconnectCount));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>重启前桥接失败 / HTTP</td><td>"));
  webServer.sendContent(String(previousBridgeFailures) + " / " +
                        String(previousBridgeHttpCode));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>Wi-Fi 内部状态</td><td>"));
  webServer.sendContent(String(wifiStatusName((uint8_t)WiFi.status())) + " (" +
                        String((int)WiFi.status()) + ")");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>本次首次 / 最后断线</td><td>"));
  webServer.sendContent(disconnectEventText(firstWifiDisconnectReason,
                        firstDisconnectWasRecovery) + " / " +
                        disconnectEventText(lastWifiDisconnectReason,
                        lastDisconnectWasRecovery));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>首次断线前无线环境</td><td>"));
  webServer.sendContent(firstWifiDisconnectReason == 0 ? "无记录" :
                        String(firstWifiDisconnectRssi) + " dBm / 信道 " +
                        String(firstWifiDisconnectChannel) + " / " +
                        wifiBssidText(firstWifiDisconnectBssid));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>最近断线时长</td><td>"));
  webServer.sendContent(String(currentWifiOutageDurationMs() / 1000UL) + " 秒");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>本次恢复时间线</td><td>"));
  webServer.sendContent(recoveryTimelineText(quickRecoveryAtMs, wifiReinitAtMs,
                        radioResetAtMs, protectiveRestartAtMs));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>断线 / 重连次数</td><td>"));
  webServer.sendContent(String(wifiDisconnectCount) + " / " + String(wifiReconnectCount));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>桥接连续 / 累计失败</td><td>"));
  webServer.sendContent(String(bridgeConsecutiveFailures) + " / " + String(bridgeTotalFailures));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>最近桥接 HTTP 结果</td><td>"));
  webServer.sendContent(String(lastBridgeHttpCode));
  webServer.sendContent_P(PSTR("</td></tr><tr><td>最近恢复动作</td><td>"));
  webServer.sendContent(htmlEscape(lastRecoveryAction));
  for (uint8_t i = 0; i < restartHistory.count; ++i) {
    const RestartHistoryEntry &entry = restartHistory.entries[i];
    webServer.sendContent_P(PSTR("</td></tr><tr><td>历史重启 #"));
    webServer.sendContent(String(entry.bootCount));
    webServer.sendContent_P(PSTR("</td><td>"));
    webServer.sendContent(String(entry.resetReason) + " · " + runtimeStageName(entry.stage) +
                          "/" + runtimeModeName(entry.mode) + " · 首次原因 " +
                          String((unsigned)entry.firstReason) + "（" +
                          disconnectOriginName(entry.firstWasRecovery != 0) + "）· " +
                          String(entry.outageDurationMs / 1000UL) + "秒");
  }
  webServer.sendContent_P(PSTR(
      "</td></tr><tr><td>空闲可用内存</td><td id='heap'>--</td></tr>"
      "<tr><td>最低空闲内存</td><td id='heapMin'>--</td></tr>"
      "<tr><td>最大连续内存块</td><td id='heapBlock'>--</td></tr>"
      "<tr><td>内存碎片率</td><td id='heapFrag'>--</td></tr>"));
  FSInfo webFsInfo;
  if (LittleFS.info(webFsInfo)) {
    webServer.sendContent_P(PSTR("<tr><td>文件存储</td><td>"));
    webServer.sendContent(String(webFsInfo.usedBytes / 1024UL) + " / " +
                          String(webFsInfo.totalBytes / 1024UL) + " KB");
    webServer.sendContent_P(PSTR("</td></tr>"));
  }
  const unsigned long upMinutes = millis() / 60000UL;
  webServer.sendContent_P(PSTR("<tr><td>运行时间</td><td>"));
  webServer.sendContent(String(upMinutes / 1440UL) + " 天 " +
      String((upMinutes / 60UL) % 24UL) + " 小时 " + String(upMinutes % 60UL) + " 分");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>OTA 可用空间</td><td>"));
  webServer.sendContent(String(ESP.getFreeSketchSpace() / 1024UL) + " KB");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>Claude</td><td>"));
  webServer.sendContent(htmlEscape(claudeStatus.status) + ", " +
                        formatTokens(claudeStatus.tokensToday) + " tok");
  webServer.sendContent_P(PSTR("</td></tr><tr><td>Codex</td><td>"));
  webServer.sendContent(htmlEscape(codexStatus.status) + ", " +
      formatTokens(codexStatus.tokensToday) + " tok, " +
      (codexStatus.primaryPct >= 0 ? "5h " + String(codexStatus.primaryPct, 0) + "%" :
       codexStatus.weeklyPct >= 0 ? "Wk " + String(codexStatus.weeklyPct, 0) + "%" : "5h ?"));
  webServer.sendContent_P(PSTR(
      "</td></tr></table>"
      "<form method='POST' action='/reconnect' onsubmit=\"return confirm('立即重新初始化 Wi-Fi？设备设置不会丢失。')\">"
      "<button type='submit' style='background:#d97706'>立即重连 Wi-Fi</button></form>"
      "<form method='POST' action='/reset-wifi' onsubmit=\"return confirm('清除 WiFi 设置并重启？设备会开启配网热点。')\">"
      "<button type='submit' style='background:#dc2626'>重置 WiFi</button></form>"
      "<h2 style='font-size:16px;margin-top:32px'>网络 OTA 固件升级</h2>"
      "<p style='font-size:13px;color:#555'>当前版本：<b>" FW_VERSION "</b>。请选择本项目生成的 ESP8266 firmware.bin。"
      "升级不会清除 Wi-Fi、轮播设置或桌宠文件。上传期间请勿断电。</p>"
      "<form method='POST' action='/update' enctype='multipart/form-data' "
      "onsubmit=\"return confirm('确认升级固件？上传和重启期间请勿断电。')\">"
      "<input type='file' name='firmware' accept='.bin,application/octet-stream' required>"
      "<button type='submit' style='background:#059669'>上传并升级</button></form>"
      "<script>function put(id,v){document.getElementById(id).textContent=v}"
      "function loadDiag(){fetch('/api/diagnostics',{cache:'no-store'}).then(r=>r.json()).then(d=>{"
      "put('heap',Math.round(d.free_heap/1024)+' KB');put('heapMin',Math.round(d.min_free_heap/1024)+' KB');"
      "put('heapBlock',Math.round(d.max_free_block/1024)+' KB');put('heapFrag',d.fragmentation+'%');"
      "}).catch(()=>{})}loadDiag();setInterval(loadDiag,5000)</script></body></html>"));
  webServer.sendContent(""); // terminating chunk for the HTTP/1.1 response
  saveRuntimeStage(STAGE_IDLE);
}

void handleApiDiagnostics() {
  JsonDocument doc;
  doc["free_heap"] = idleFreeHeap;
  doc["min_free_heap"] = minimumIdleFreeHeap;
  doc["max_free_block"] = idleMaxFreeBlock;
  doc["fragmentation"] = idleHeapFragmentation;
  doc["reset_reason"] = lastResetReason;
  doc["reset_info"] = lastResetInfo;
  doc["boot_count"] = bootCount;
  doc["previous_stage"] = runtimeStageName(previousRuntimeStage);
  doc["previous_mode"] = runtimeModeName(previousRuntimeMode);
  doc["previous_recovery_step"] = recoveryStepName(previousRecoveryStep);
  doc["previous_first_disconnect_reason"] = previousFirstWifiDisconnectReason;
  doc["previous_last_disconnect_reason"] = previousLastWifiDisconnectReason;
  doc["previous_first_disconnect_origin"] = disconnectOriginName(previousFirstDisconnectWasRecovery);
  doc["previous_last_disconnect_origin"] = disconnectOriginName(previousLastDisconnectWasRecovery);
  doc["previous_first_disconnect_rssi"] = previousFirstWifiRssi;
  doc["previous_first_disconnect_channel"] = previousFirstWifiChannel;
  doc["previous_first_disconnect_bssid"] = wifiBssidText(previousFirstWifiBssid);
  doc["previous_outage_ms"] = previousOutageDurationMs;
  doc["previous_recovery_timeline"] = recoveryTimelineText(previousQuickRecoveryAtMs,
      previousWifiReinitAtMs, previousRadioResetAtMs, previousProtectiveRestartAtMs);
  doc["previous_wifi_disconnects"] = previousWifiDisconnectCount;
  doc["previous_wifi_reconnects"] = previousWifiReconnectCount;
  doc["previous_bridge_failures"] = previousBridgeFailures;
  doc["previous_bridge_http_code"] = previousBridgeHttpCode;
  doc["wifi_status"] = (int)WiFi.status();
  doc["first_disconnect_reason"] = firstWifiDisconnectReason;
  doc["last_disconnect_reason"] = lastWifiDisconnectReason;
  doc["first_disconnect_origin"] = disconnectOriginName(firstDisconnectWasRecovery);
  doc["last_disconnect_origin"] = disconnectOriginName(lastDisconnectWasRecovery);
  doc["first_disconnect_rssi"] = firstWifiDisconnectRssi;
  doc["first_disconnect_channel"] = firstWifiDisconnectChannel;
  doc["first_disconnect_bssid"] = wifiBssidText(firstWifiDisconnectBssid);
  doc["outage_ms"] = currentWifiOutageDurationMs();
  doc["recovery_timeline"] = recoveryTimelineText(quickRecoveryAtMs, wifiReinitAtMs,
                                                   radioResetAtMs, protectiveRestartAtMs);
  doc["wifi_disconnects"] = wifiDisconnectCount;
  doc["wifi_reconnects"] = wifiReconnectCount;
  doc["bridge_consecutive_failures"] = bridgeConsecutiveFailures;
  doc["bridge_total_failures"] = bridgeTotalFailures;
  doc["last_bridge_http_code"] = lastBridgeHttpCode;
  doc["last_recovery_action"] = lastRecoveryAction;
  JsonArray history = doc["restart_history"].to<JsonArray>();
  for (uint8_t i = 0; i < restartHistory.count; ++i) {
    const RestartHistoryEntry &entry = restartHistory.entries[i];
    JsonObject item = history.add<JsonObject>();
    item["boot_count"] = entry.bootCount;
    item["reset_reason"] = entry.resetReason;
    item["stage"] = runtimeStageName(entry.stage);
    item["mode"] = runtimeModeName(entry.mode);
    item["recovery_step"] = recoveryStepName(entry.recoveryStep);
    item["first_reason"] = entry.firstReason;
    item["last_reason"] = entry.lastReason;
    item["first_origin"] = disconnectOriginName(entry.firstWasRecovery != 0);
    item["first_rssi"] = entry.firstRssi;
    item["first_channel"] = entry.firstChannel;
    item["outage_ms"] = entry.outageDurationMs;
  }
  String body;
  serializeJson(doc, body);
  webServer.sendHeader("Cache-Control", "no-store");
  webServer.send(200, "application/json", body);
}

void handleManualReconnect() {
  webServer.send(200, "text/html; charset=utf-8",
                 "<!doctype html><meta charset='utf-8'><meta name='viewport' content='width=device-width'>"
                 "<h2>正在重新连接 Wi-Fi</h2><p>设备会保留全部设置，请等待约 20 秒后返回诊断页。</p>"
                 "<script>setTimeout(()=>location.href='/',20000)</script>");
  manualReconnectAtMs = millis() + 500UL;
}

void handleSave() {
  String newHost = webServer.arg("bridge");
  newHost.trim();
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[web] bridge host updated to '%s'\n", bridgeHost.c_str());
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

// ---------- JSON API for the Mac app ----------

const char *displayModeName(DisplayMode m) {
  if (m == MODE_CLAUDE) return "claude";
  if (m == MODE_CODEX) return "codex";
  if (m == MODE_NET) return "net";
  if (m == MODE_MUSIC) return "music";
  if (m == MODE_STOCK) return "stock";
  if (m == MODE_MARKET) return "market";
  if (m == MODE_WEATHER) return "weather";
  return "auto";
}

void handleApiInfo() {
  JsonDocument doc;
  doc["ip"] = WiFi.localIP().toString();
  doc["ssid"] = WiFi.SSID();
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);           // configured mode
  doc["effective"] = displayModeName(effectiveMode());   // what's on screen now
  doc["music_playing"] = statusMusicPlaying;
  doc["showing"] = (currentApp == APP_CLAUDE) ? "claude" : "codex";
  doc["last_update_s"] = everPolled ? (long)((millis() - lastSuccessMs) / 1000) : -1;
  doc["sprite_rev"] = spriteRev;
  doc["brightness"] = brightness;
  doc["wired"] = wiredActive(); // true = data currently arrives over USB serial
  doc["fw"] = FW_VERSION;
  doc["bridge_version"] = bridgeVersion;
  doc["rssi"] = WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : -127;
  doc["free_heap"] = idleFreeHeap;
  doc["min_free_heap"] = minimumIdleFreeHeap;
  doc["max_free_block"] = idleMaxFreeBlock;
  doc["heap_fragmentation"] = idleHeapFragmentation;
  doc["reset_reason"] = lastResetReason;
  doc["boot_count"] = bootCount;
  doc["previous_stage"] = runtimeStageName(previousRuntimeStage);
  doc["previous_mode"] = runtimeModeName(previousRuntimeMode);
  doc["wifi_status"] = (int)WiFi.status();
  doc["first_wifi_disconnect_reason"] = firstWifiDisconnectReason;
  doc["last_wifi_disconnect_reason"] = lastWifiDisconnectReason;
  doc["wifi_disconnect_reason"] = lastWifiDisconnectReason; // compatibility
  doc["first_wifi_disconnect_origin"] = disconnectOriginName(firstDisconnectWasRecovery);
  doc["last_wifi_disconnect_origin"] = disconnectOriginName(lastDisconnectWasRecovery);
  doc["first_wifi_disconnect_rssi"] = firstWifiDisconnectRssi;
  doc["first_wifi_disconnect_channel"] = firstWifiDisconnectChannel;
  doc["first_wifi_disconnect_bssid"] = wifiBssidText(firstWifiDisconnectBssid);
  doc["wifi_outage_ms"] = currentWifiOutageDurationMs();
  doc["wifi_disconnects"] = wifiDisconnectCount;
  doc["wifi_reconnects"] = wifiReconnectCount;
  doc["bridge_consecutive_failures"] = bridgeConsecutiveFailures;
  doc["bridge_total_failures"] = bridgeTotalFailures;
  doc["last_bridge_http_code"] = lastBridgeHttpCode;
  doc["last_recovery_action"] = lastRecoveryAction;
  doc["uptime_s"] = millis() / 1000UL;
  doc["ota_space"] = ESP.getFreeSketchSpace();
  FSInfo fsInfo;
  if (LittleFS.info(fsInfo)) {
    doc["fs_used"] = fsInfo.usedBytes;
    doc["fs_total"] = fsInfo.totalBytes;
  }
  doc["auto_seconds"] = activeAutoCycleSeconds();
  doc["auto_schedule"] = weatherIsWeekend() ? "weekend" : "weekday";
  JsonArray autoPages = doc["auto_pages"].to<JsonArray>();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (activeAutoPageMask() & (1U << mode)) autoPages.add(displayModeName((DisplayMode)mode));
  }
  doc["weekday_auto_seconds"] = weekdayAutoCycleSeconds;
  JsonArray weekdayPages = doc["weekday_auto_pages"].to<JsonArray>();
  doc["weekend_auto_seconds"] = weekendAutoCycleSeconds;
  JsonArray weekendPages = doc["weekend_auto_pages"].to<JsonArray>();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (weekdayAutoPageMask & (1U << mode)) weekdayPages.add(displayModeName((DisplayMode)mode));
    if (weekendAutoPageMask & (1U << mode)) weekendPages.add(displayModeName((DisplayMode)mode));
  }
  JsonObject c = doc["claude"].to<JsonObject>();
  c["status"] = claudeStatus.status;
  c["custom_sprite"] = claudeCustom;
  c["w"] = CLAUDE_SPRITE_W;
  c["h"] = CLAUDE_SPRITE_H;
  JsonObject x = doc["codex"].to<JsonObject>();
  x["status"] = codexStatus.status;
  x["custom_sprite"] = codexCustom;
  x["w"] = CODEX_SPRITE_W;
  x["h"] = CODEX_SPRITE_H;
  String out;
  serializeJson(doc, out);
  webServer.send(200, "application/json", out);
}

void handleApiDisplay() {
  String mode = webServer.arg("mode");
  if (mode == "auto") {
    displayMode = MODE_AUTO;
    resetAutoCyclePosition();
    lastEffectiveMode = MODE_AUTO; // effective carousel pages never equal AUTO
  }
  else if (mode == "claude") displayMode = MODE_CLAUDE;
  else if (mode == "codex") displayMode = MODE_CODEX;
  else if (mode == "net") displayMode = MODE_NET;
  else if (mode == "music") displayMode = MODE_MUSIC;
  else if (mode == "stock") displayMode = MODE_STOCK;
  else if (mode == "market") displayMode = MODE_MARKET;
  else if (mode == "weather") displayMode = MODE_WEATHER;
  else {
    webServer.send(400, "text/plain", "mode must be auto|claude|codex|net|music|stock|market|weather");
    return;
  }
  Serial.printf("[api] display mode = %s\n", mode.c_str());
  if (displayMode == MODE_AUTO) {
    // loop() performs the first selected page's normal transition atomically.
  } else if (displayMode == MODE_NET) {
    netChromeDrawn = false;
    lastNetPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MUSIC) {
    musicChromeDrawn = false;
    lastMusicPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_STOCK) {
    stockChromeDrawn = false;
    lastStockPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MARKET) {
    lastMarketPollMs = 0;
    lastMarketFrameVersion = 0; // force a redraw when returning from another page
  } else if (displayMode == MODE_WEATHER) {
    weatherChromeDrawn = false;
    lastWeatherPollMs = 0;
  } else {
    updateActiveApp();
    drawActiveApp(); // unconditional: also repaints over a previous net chart
  }
  webServer.send(200, "text/plain", "ok");
}

bool parseAutoPageList(String pages, uint16_t &mask) {
  mask = 0;
  while (pages.length() > 0) {
    int comma = pages.indexOf(',');
    String page = comma >= 0 ? pages.substring(0, comma) : pages;
    pages = comma >= 0 ? pages.substring(comma + 1) : "";
    page.trim();
    if (page == "codex") mask |= 1U << MODE_CODEX;
    else if (page == "music") mask |= 1U << MODE_MUSIC;
    else if (page == "stock") mask |= 1U << MODE_STOCK;
    else if (page == "market") mask |= 1U << MODE_MARKET;
    else if (page == "weather") mask |= 1U << MODE_WEATHER;
    else if (page.length() > 0) return false;
  }
  return mask != 0;
}

