dinga1981/esp8266-ai/firmware/src/main.cpp
void handleApiAutoCycle() {
  const bool splitSchedule = webServer.hasArg("weekday_pages") || webServer.hasArg("weekend_pages");
  String weekdayPages = splitSchedule ? webServer.arg("weekday_pages") : webServer.arg("pages");
  String weekendPages = splitSchedule ? webServer.arg("weekend_pages") : webServer.arg("pages");
  const int weekdaySeconds = (splitSchedule ? webServer.arg("weekday_seconds")
                                             : webServer.arg("seconds")).toInt();
  const int weekendSeconds = (splitSchedule ? webServer.arg("weekend_seconds")
                                             : webServer.arg("seconds")).toInt();
  uint16_t weekdayMask = 0, weekendMask = 0;
  if (!parseAutoPageList(weekdayPages, weekdayMask) ||
      !parseAutoPageList(weekendPages, weekendMask)) {
    webServer.send(400, "text/plain", "each schedule needs codex|music|stock|market|weather");
    return;
  }
  if (!validAutoCycleSeconds(weekdaySeconds) || !validAutoCycleSeconds(weekendSeconds)) {
    webServer.send(400, "text/plain", "seconds must be 5|10|15|20|30|60|120");
    return;
  }
  weekdayAutoPageMask = weekdayMask;
  weekdayAutoCycleSeconds = weekdaySeconds;
  weekendAutoPageMask = weekendMask;
  weekendAutoCycleSeconds = weekendSeconds;
  resetAutoCyclePosition();
  saveAutoCycle();
  if (displayMode == MODE_AUTO) lastEffectiveMode = MODE_AUTO;
  Serial.printf("[api] auto weekday=%u/%u weekend=%u/%u\n", weekdayAutoPageMask,
                weekdayAutoCycleSeconds, weekendAutoPageMask, weekendAutoCycleSeconds);
  webServer.send(200, "text/plain", "ok");
}

void handleApiBrightness() {
  String levelArg = webServer.arg("level");
  if (levelArg.length() == 0) {
    webServer.send(400, "text/plain", "missing level (0-100)");
    return;
  }
  int level = levelArg.toInt();
  if (level < 0) level = 0;
  if (level > 100) level = 100;
  brightness = level;
  applyBrightness();
  saveBrightness();
  Serial.printf("[api] brightness = %d\n", brightness);
  webServer.send(200, "text/plain", "ok");
}

void handleApiBridge() {
  String newHost = webServer.arg("host");
  newHost.trim();
  if (newHost.length() == 0) {
    webServer.send(400, "text/plain", "missing host");
    return;
  }
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[api] bridge host = '%s'\n", bridgeHost.c_str());
  webServer.send(200, "text/plain", "ok");
  lastPollMs = 0; // poll the new bridge on the next loop tick
}

void appendAutoPages(JsonArray pages, uint16_t mask) {
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (mask & (1U << mode)) pages.add(displayModeName((DisplayMode)mode));
  }
}

void handleApiSettingsGet() {
  JsonDocument doc;
  doc["schema"] = 1;
  doc["firmware"] = FW_VERSION;
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);
  doc["brightness"] = brightness;
  doc["weekday_seconds"] = weekdayAutoCycleSeconds;
  appendAutoPages(doc["weekday_pages"].to<JsonArray>(), weekdayAutoPageMask);
  doc["weekend_seconds"] = weekendAutoCycleSeconds;
  appendAutoPages(doc["weekend_pages"].to<JsonArray>(), weekendAutoPageMask);
  String out;
  serializeJson(doc, out);
  webServer.send(200, "application/json", out);
}

bool settingsMask(JsonVariantConst value, uint16_t &mask) {
  if (!value.is<JsonArrayConst>()) return false;
  mask = 0;
  for (JsonVariantConst item : value.as<JsonArrayConst>()) {
    if (!item.is<const char *>()) return false;
    String page = item.as<const char *>();
    if (page == "diag") continue; // migrate short-lived v0.5.9-test backups
    uint16_t bit = 0;
    if (!parseAutoPageList(page, bit)) return false;
    mask |= bit;
  }
  if (mask == 0) mask = 1U << MODE_CODEX;
  return true;
}

void handleApiSettingsRestore() {
  const String body = webServer.arg("plain");
  if (body.length() == 0 || body.length() > 4096) {
    webServer.send(400, "text/plain", "invalid settings body");
    return;
  }
  JsonDocument doc;
  if (deserializeJson(doc, body) || (doc["schema"] | 0) != 1) {
    webServer.send(400, "text/plain", "unsupported settings file");
    return;
  }
  uint16_t weekdayMask = 0, weekendMask = 0;
  const int weekdaySeconds = doc["weekday_seconds"] | 0;
  const int weekendSeconds = doc["weekend_seconds"] | 0;
  if (!settingsMask(doc["weekday_pages"], weekdayMask) ||
      !settingsMask(doc["weekend_pages"], weekendMask) ||
      !validAutoCycleSeconds(weekdaySeconds) || !validAutoCycleSeconds(weekendSeconds)) {
    webServer.send(400, "text/plain", "invalid auto schedule");
    return;
  }
  const char *modeValue = doc["mode"] | "auto";
  String mode(modeValue);
  DisplayMode restoredMode = MODE_AUTO;
  if (mode == "codex") restoredMode = MODE_CODEX;
  else if (mode == "music") restoredMode = MODE_MUSIC;
  else if (mode == "stock") restoredMode = MODE_STOCK;
  else if (mode == "market") restoredMode = MODE_MARKET;
  else if (mode == "weather") restoredMode = MODE_WEATHER;
  else if (mode == "diag") restoredMode = MODE_CODEX; // no longer a screen page
  else if (mode != "auto") {
    webServer.send(400, "text/plain", "invalid display mode");
    return;
  }

  String restoredBridge = doc["bridge"] | "";
  restoredBridge.trim();
  bridgeHost = restoredBridge;
  saveBridgeHost(bridgeHost);
  brightness = constrain(doc["brightness"] | BRIGHTNESS_DEFAULT, 0, 100);
  applyBrightness();
  saveBrightness();
  weekdayAutoPageMask = weekdayMask;
  weekdayAutoCycleSeconds = weekdaySeconds;
  weekendAutoPageMask = weekendMask;
  weekendAutoCycleSeconds = weekendSeconds;
  saveAutoCycle();
  displayMode = restoredMode;
  resetAutoCyclePosition();
  lastEffectiveMode = MODE_AUTO;
  webServer.send(200, "application/json", "{\"ok\":true}");
}

bool otaUploadOK = false;
bool otaUploadStarted = false;
String otaUploadError;
unsigned long otaRestartAtMs = 0;

void handleOtaUploadChunk() {
  HTTPUpload &upload = webServer.upload();
  if (upload.status == UPLOAD_FILE_START) {
    saveRuntimeStage(STAGE_OTA);
    otaUploadOK = false;
    otaUploadStarted = true;
    otaUploadError = "";
    String filename = upload.filename;
    filename.toLowerCase();
    if (!filename.endsWith(".bin")) {
      otaUploadError = "请选择 ESP8266 firmware.bin 文件";
      return;
    }
    const size_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH)) {
      otaUploadError = "设备没有足够的 OTA 空间";
      return;
    }
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.drawString("FIRMWARE UPDATE", SCREEN_CX, 75, 2);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("Uploading...", SCREEN_CX, 110, 2);
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (otaUploadError.length() > 0) return;
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      otaUploadError = "写入固件失败";
      Update.end(false);
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (otaUploadError.length() == 0 && Update.end(true)) {
      otaUploadOK = true;
    } else if (otaUploadError.length() == 0) {
      otaUploadError = "固件校验失败，设备仍保留旧版本";
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end(false);
    otaUploadError = "上传已中止";
  }
}

void handleOtaUploadDone() {
  if (!otaUploadStarted || !otaUploadOK) {
    const String message = otaUploadError.length() ? otaUploadError : "没有收到固件文件";
    webServer.send(400, "text/plain; charset=utf-8", message);
    otaUploadStarted = false;
    return;
  }
  webServer.send(200, "text/html; charset=utf-8",
                 "<!doctype html><meta charset='utf-8'><meta name='viewport' content='width=device-width'>"
                 "<h2>升级成功</h2><p>设备正在重启。Wi-Fi、轮播设置和桌宠文件会保留。</p>"
                 "<script>setTimeout(()=>location.href='/',12000)</script>");
  otaUploadStarted = false;
  otaRestartAtMs = millis() + 1200UL;
}

